# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArray..::..Append Method
ModelCurveArray Class See Also
---
Add the model curve to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	ModelCurve item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As ModelCurve _
)
```

Visual C++
---
```text
public:
virtual void Append(
	ModelCurve^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ModelCurveThe model curve to be added.
# See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace